Revit 2026 API

# BeamSystemCreate(Document, IListCurve, Level, Int32, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static BeamSystem Create(
	Document document,
	IList<Curve> profile,
	Level level,
	int curveIndexForDirection,
	bool is3d
)
```
```vb
Public Shared Function Create (
	document As Document,
	profile As IList(Of Curve),
	level As Level,
	curveIndexForDirection As Integer,
	is3d As Boolean
) As BeamSystem
```
```cpp
public:
static BeamSystem^ Create(
	Document^ document,
	IList<Curve^>^ profile,
	Level^ level,
	int curveIndexForDirection,
	bool is3d
)
```
```fsharp
static member Create :
        document : Document *
        profile : IList<Curve> *
        level : Level *
        curveIndexForDirection : int *
        is3d : bool -> BeamSystem
```

#### Parameters

document Document

profile IListCurve

level Level

curveIndexForDirection Int32

is3d Boolean

#### Return Value

BeamSystem

#### Reference

BeamSystem Class

Create Overload

Autodesk.Revit.DB Namespace